dm4t/triples.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>DM4T PROJECT</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Matt Thompson">
<link rel="stylesheet" type="text/css" href="../style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">DM4T PROJECT</h1>
</header><hr >

<div id="outline-container-org36884c2" class="outline-2">
<h2 id="org36884c2">Converting CSV Tables into RDF Triples with Grafter</h2>
<div class="outline-text-2" id="text-org36884c2">
<p>
PLEASE NOTE: This article is a work in progress!
</p>
</div>

<div id="outline-container-org9ca8d59" class="outline-3">
<h3 id="org9ca8d59">Context: The DM4T Project</h3>
<div class="outline-text-3" id="text-org9ca8d59">
<p>
<a href="https://teddinet.org">TEDDINET</a> is a multi-disciplinary research project to monitor the energy usage of homes and appliances, and work out ways to reduce it. From 2013 up until 2016, millions of sensor readings have been taken from hundreds of homes, recording data such as power usage, temperature, humidity, and sound levels. Now that all the data have been gathered, we have to figure out how to process it to make it easy to query and visualise.
</p>

<p>
<a href="http://www.cs.bath.ac.uk/dm4t/index.shtml">DM4T</a> is a sub-project of TEDDINET with the aim to manage these data
</p>
</div>
</div>

<div id="outline-container-org28d29e1" class="outline-3">
<h3 id="org28d29e1">The CSV Problem</h3>
</div>
<div id="outline-container-orgb68ebb4" class="outline-3">
<h3 id="orgb68ebb4">Tools to Solve the Problem</h3>
</div>
<div id="outline-container-org59f5b41" class="outline-3">
<h3 id="org59f5b41">Generating RDF from CSV</h3>
</div>
<div id="outline-container-orgd5f287d" class="outline-3">
<h3 id="orgd5f287d">Grafter: Industrial-strength RDF Production</h3>
<div class="outline-text-3" id="text-orgd5f287d">
</div><div id="outline-container-orgf81bce1" class="outline-4">
<h4 id="orgf81bce1">What is Grafter?</h4>
</div>
<div id="outline-container-orga4057a8" class="outline-4">
<h4 id="orga4057a8">Table Conversions</h4>
</div>
<div id="outline-container-org7c7bed5" class="outline-4">
<h4 id="org7c7bed5">Graph Generation</h4>
</div>
<div id="outline-container-org602b5b6" class="outline-4">
<h4 id="org602b5b6">Pipeline Generation</h4>
</div>
</div>

<div id="outline-container-org6eec5c8" class="outline-3">
<h3 id="org6eec5c8">Datasets Used</h3>
</div>
<div id="outline-container-orgf8bd61b" class="outline-3">
<h3 id="orgf8bd61b">Choosing an Ontology</h3>
</div>
<div id="outline-container-orga45983a" class="outline-3">
<h3 id="orga45983a">Example Triples</h3>
</div>
<div id="outline-container-org03ceb45" class="outline-3">
<h3 id="org03ceb45">Setting up a SPARQL Endpoint</h3>
<div class="outline-text-3" id="text-org03ceb45">
<p>
The process of converting our TSV files into n-triple (nt) format is ballooning their size by a factor of 10. Take, for example, the light readings dataset:
</p>

<ul class="org-ul">
<li>Original TSV size: 890MB</li>
<li>Converted N-Triples size: 19GB</li>
</ul>

<p>
As well as taking up all this space, it is impractical to load these triples into memory for use in a SPARQL endpoint.
</p>



<hr >

<div align=center>
<p>
<a href="http://mthompson.org">Home</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Thompson</p>
<p class="validation"></p>
</div>
</body>
</html>
